---
kind: property
id: P:Autodesk.Revit.DB.Document.SiteLocation
zh: 文档、文件
source: html/0567eac8-811f-aed3-1ef3-c909992ceca7.htm
---
# Autodesk.Revit.DB.Document.SiteLocation Property

**中文**: 文档、文件

Returns the site location information.

## Syntax (C#)
```csharp
public SiteLocation SiteLocation { get; }
```

## Remarks
The SiteLocation property returns an object that contains the site location
for the entire project.